links.org
# -*- coding:utf-8 -*-
#+AUTHOR: ifritJP
#+STARTUP: nofold
#+OPTIONS: ^:{}

#+TITLE: Qiita に登録した記事のリンク

** lctags

開発中の C/C++ 向けのソースコードタグシステム lctags の紹介記事。

オススメ。
   
- C/C++ ソースコードタグシステム lctags の紹介
  - https://qiita.com/dwarfJP/items/982ef7ee3f3bfd435156
- C言語/C++ コードを解析してインタラクティブなコールグラフ表示 by lctags
  - https://qiita.com/dwarfJP/items/ef868813a7aaa2572468
- lctags のプロジェクト簡易登録
  - https://qiita.com/dwarfJP/items/965cfbf31a49998df95d
- C/C++ の変数サイズ確認 by lctags on emacs
  - https://qiita.com/dwarfJP/items/2ce744f3e534a943c98d
- C/C++ の enum 補完 by lctags on emacs
  - https://qiita.com/dwarfJP/items/29b4b1a4490c1ba42b9a
- C/C++ ソースコードをリファクタリング by lctags on emacs (リネーム編)
  - https://qiita.com/dwarfJP/items/b702c60ff0381750e746
- C/C++ の特定シンボルをハイライト by lctags on emacs
  - https://qiita.com/dwarfJP/items/b702c60ff0381750e746
- lctags で C 言語の関数コールを簡単に
  - https://qiita.com/dwarfJP/items/b702c60ff0381750e746
- lctags を使って C/C++ ソースコードをリファクタリング(サブルーチン化編)
  - https://qiita.com/dwarfJP/items/263db943fe8ebc407abb

** libclang

- Lua で C/C++ の構文解析 (libclang の Lua binding)
  - https://qiita.com/dwarfJP/items/607d46e0a1dcb1e3a2a5
- libclang の AST(Abstract Syntax Tree)
  - https://qiita.com/dwarfJP/items/c003acc108d1320bce68
- libclang で演算子を特定する方法
  - https://qiita.com/dwarfJP/items/5fe29d4c22c8d76aac0b

** Lua

Lua でググると何気に上位にくる。

- C/C++ 言語プログラマのための Lua 入門リファレンス
  - https://qiita.com/dwarfJP/items/e033728f5cbecbabe11f
- C/C++ 言語プログラマのための Lua 入門リファレンス ( ポインタ編 )
  - https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c
- C/C++ 言語プログラマのための Lua 入門リファレンス ( C インタフェース編 )
  - https://qiita.com/dwarfJP/items/ae116b404be0b09255ff
- LDT のリモートデバッグでブレークポイントが設定できない件
  - https://qiita.com/dwarfJP/items/76f403a9f7b07bc5d9b5
    

** emacs    

- emacs の org-mode で書いた記事を qiita に投稿する org-qiita.el
  - https://qiita.com/dwarfJP/items/594a8d4b0ac6d248d1e4
- emacs 簡易 HTTPD 化パケージ simple-httpd.el
  - https://qiita.com/dwarfJP/items/f020c776213cd2f1d4f3
- emacs で hipchat
  - https://qiita.com/dwarfJP/items/019e74f5bffd036e95a8

** プログラミング

- D3.js V4 forceSimulation のノード動的更新(追加・削除)
  - https://qiita.com/dwarfJP/items/11604cb272688458b051
- オブジェクト指向、アスペクト指向は用法・用量を守ってご使用ください
  - https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed
- C/C++エンジニアのための Rust のデータ所有権とライフタイム入門
  - https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c
- OpenSSL ライブラリを使ったハッシュ生成、暗号化(RSA, AES)、復号処理(RSA, AES)、署名生成(RSA)、署名検証(RSA)
  - https://qiita.com/dwarfJP/items/f849dd904d4c85eec38d
- OpenSSL ライブラリを使った RSA 復号処理に手間取った件
  - https://qiita.com/dwarfJP/items/78401456b13a30f4731e

    
** C 言語

- lctags を開発している時に改めて感じた C 言語規格のイケてないところ
  - https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed
- 意外と知らない C 言語のコンパイラ依存
  - https://qiita.com/dwarfJP/items/c835d14bd02f06ac2fcc


** その他

- Windows で意図しないキーボード配列(US/JIS)になった場合の確認事項
  - https://qiita.com/dwarfJP/items/594e84578f6186f68db9
- Windows10 になって fakecygpty が動作しなくなったんで gpg 周りを見直した
  - https://qiita.com/dwarfJP/items/eb0a2a7fbb99779ea796
- Windows + Android(iOS)端末でフリーなマルチディスプレイ環境構築
  - https://qiita.com/dwarfJP/items/2e1491e8144355e6d7f9
- Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説
  - https://qiita.com/dwarfJP/items/a4a90d5c0aa2833dac5b
