links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Qiita に登録した記事のリンク</title>
<!-- 2018-06-02 土 19:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ifritJP" />
</head>
<body>
<div id="content">
<h1 class="title">Qiita に登録した記事のリンク</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. C 言語</a></li>
<li><a href="#sec-2">2. lctags</a></li>
<li><a href="#sec-3">3. libclang</a></li>
<li><a href="#sec-4">4. emacs</a></li>
<li><a href="#sec-5">5. プログラミング</a></li>
<li><a href="#sec-6">6. Lua</a></li>
<li><a href="#sec-7">7. その他</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> C 言語</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>lctags を開発している時に改めて感じた C 言語規格のイケてないところ
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed">https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed</a>
</li>
</ul>
</li>
<li>意外と知らない C 言語のコンパイラ依存
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/c835d14bd02f06ac2fcc">https://qiita.com/dwarfJP/items/c835d14bd02f06ac2fcc</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> lctags</h2>
<div class="outline-text-2" id="text-2">
<p>
開発中の C/C++ 向けのソースコードタグシステム lctags の紹介記事。
</p>

<p>
オススメ。
</p>

<ul class="org-ul">
<li>C/C++ ソースコードタグシステム lctags の紹介
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/982ef7ee3f3bfd435156">https://qiita.com/dwarfJP/items/982ef7ee3f3bfd435156</a>
</li>
</ul>
</li>
<li>C言語/C++ コードを解析してインタラクティブなコールグラフ表示 by lctags
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/ef868813a7aaa2572468">https://qiita.com/dwarfJP/items/ef868813a7aaa2572468</a>
</li>
</ul>
</li>
<li>lctags のプロジェクト簡易登録
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/965cfbf31a49998df95d">https://qiita.com/dwarfJP/items/965cfbf31a49998df95d</a>
</li>
</ul>
</li>
<li>C/C++ の変数サイズ確認 by lctags on emacs
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/2ce744f3e534a943c98d">https://qiita.com/dwarfJP/items/2ce744f3e534a943c98d</a>
</li>
</ul>
</li>
<li>C/C++ の enum 補完 by lctags on emacs
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/29b4b1a4490c1ba42b9a">https://qiita.com/dwarfJP/items/29b4b1a4490c1ba42b9a</a>
</li>
</ul>
</li>
<li>C/C++ ソースコードをリファクタリング by lctags on emacs (リネーム編)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/b702c60ff0381750e746">https://qiita.com/dwarfJP/items/b702c60ff0381750e746</a>
</li>
</ul>
</li>
<li>C/C++ の特定シンボルをハイライト by lctags on emacs
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/b702c60ff0381750e746">https://qiita.com/dwarfJP/items/b702c60ff0381750e746</a>
</li>
</ul>
</li>
<li>lctags で C 言語の関数コールを簡単に
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/b702c60ff0381750e746">https://qiita.com/dwarfJP/items/b702c60ff0381750e746</a>
</li>
</ul>
</li>
<li>lctags を使って C/C++ ソースコードをリファクタリング(サブルーチン化編)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/263db943fe8ebc407abb">https://qiita.com/dwarfJP/items/263db943fe8ebc407abb</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> libclang</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Lua で C/C++ の構文解析 (libclang の Lua binding)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/607d46e0a1dcb1e3a2a5">https://qiita.com/dwarfJP/items/607d46e0a1dcb1e3a2a5</a>
</li>
</ul>
</li>
<li>libclang の AST(Abstract Syntax Tree)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/c003acc108d1320bce68">https://qiita.com/dwarfJP/items/c003acc108d1320bce68</a>
</li>
</ul>
</li>
<li>libclang で演算子を特定する方法
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/5fe29d4c22c8d76aac0b">https://qiita.com/dwarfJP/items/5fe29d4c22c8d76aac0b</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> emacs</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>emacs の org-mode で書いた記事を qiita に投稿する org-qiita.el
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/594a8d4b0ac6d248d1e4">https://qiita.com/dwarfJP/items/594a8d4b0ac6d248d1e4</a>
</li>
</ul>
</li>
<li>emacs 簡易 HTTPD 化パケージ simple-httpd.el
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/f020c776213cd2f1d4f3">https://qiita.com/dwarfJP/items/f020c776213cd2f1d4f3</a>
</li>
</ul>
</li>
<li>emacs で hipchat
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/019e74f5bffd036e95a8">https://qiita.com/dwarfJP/items/019e74f5bffd036e95a8</a>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> プログラミング</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>D3.js V4 forceSimulation のノード動的更新(追加・削除)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/11604cb272688458b051">https://qiita.com/dwarfJP/items/11604cb272688458b051</a>
</li>
</ul>
</li>
<li>オブジェクト指向、アスペクト指向は用法・用量を守ってご使用ください
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed">https://qiita.com/dwarfJP/items/f1ce004a157566ff60ed</a>
</li>
</ul>
</li>
<li>C/C++エンジニアのための Rust のデータ所有権とライフタイム入門
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c">https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c</a>
</li>
</ul>
</li>
<li>OpenSSL ライブラリを使ったハッシュ生成、暗号化(RSA, AES)、復号処理(RSA, AES)、署名生成(RSA)、署名検証(RSA)
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/f849dd904d4c85eec38d">https://qiita.com/dwarfJP/items/f849dd904d4c85eec38d</a>
</li>
</ul>
</li>
<li>OpenSSL ライブラリを使った RSA 復号処理に手間取った件
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/78401456b13a30f4731e">https://qiita.com/dwarfJP/items/78401456b13a30f4731e</a>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lua</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>C/C++ 言語プログラマのための Lua 入門リファレンス ( ポインタ編 )
<a href="https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c">https://qiita.com/dwarfJP/items/0c92cedb819b578ac06c</a>
</li>
<li>C/C++ 言語プログラマのための Lua 入門リファレンス ( C インタフェース編 )
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/ae116b404be0b09255ff">https://qiita.com/dwarfJP/items/ae116b404be0b09255ff</a>
</li>
</ul>
</li>
<li>C/C++ 言語プログラマのための Lua 入門リファレンス
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/e033728f5cbecbabe11f">https://qiita.com/dwarfJP/items/e033728f5cbecbabe11f</a>
</li>
</ul>
</li>
<li>LDT のリモートデバッグでブレークポイントが設定できない件
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/76f403a9f7b07bc5d9b5">https://qiita.com/dwarfJP/items/76f403a9f7b07bc5d9b5</a>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> その他</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Windows で意図しないキーボード配列(US/JIS)になった場合の確認事項
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/594e84578f6186f68db9">https://qiita.com/dwarfJP/items/594e84578f6186f68db9</a>
</li>
</ul>
</li>
<li>Windows10 になって fakecygpty が動作しなくなったんで gpg 周りを見直した
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/eb0a2a7fbb99779ea796">https://qiita.com/dwarfJP/items/eb0a2a7fbb99779ea796</a>
</li>
</ul>
</li>
<li>Windows + Android(iOS)端末でフリーなマルチディスプレイ環境構築
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/2e1491e8144355e6d7f9">https://qiita.com/dwarfJP/items/2e1491e8144355e6d7f9</a>
</li>
</ul>
</li>
<li>Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説
<ul class="org-ul">
<li><a href="https://qiita.com/dwarfJP/items/a4a90d5c0aa2833dac5b">https://qiita.com/dwarfJP/items/a4a90d5c0aa2833dac5b</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ifritJP</p>
<p class="date">Created: 2018-06-02 土 19:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode N/A-fixup)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>